In [5]:
# Import dependencies
import pandas as pd
from sqlalchemy import create_engine

### Store Movie CSV into DataFrame

In [6]:
movie_csv_file = "movies.csv"
movie_df = pd.read_csv(movie_csv_file)
movie_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

### Create new Movie DataFrame with select columns

In [55]:
clean_movie_df = movie_data_df[['movieId', 'title']].copy()
clean_movie_df.head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [56]:
# Rename columns
clean_movie_df = clean_movie_df.rename(columns = {'movieId': 'movie_id'})
clean_movie_df.head()

   movie_id                               title
0         1                    Toy Story (1995)
1         2                      Jumanji (1995)
2         3             Grumpier Old Men (1995)
3         4            Waiting to Exhale (1995)
4         5  Father of the Bride Part II (1995)

In [57]:
# Confirm dtypes for dataframe
clean_movie_df.dtypes

movie_id     int64
title       object
dtype: object

In [62]:
# Split movie title from movie year and create a new column for movie year
new = clean_movie_df.title.str.split("(",1, expand = True) 
new.head()

                              0      1
0                    Toy Story   1995)
1                      Jumanji   1995)
2             Grumpier Old Men   1995)
3            Waiting to Exhale   1995)
4  Father of the Bride Part II   1995)

### Store Ratings CSV into DataFrame

In [53]:
ratings_csv_file = 'ratings.csv'
ratings_df = pd.read_csv(ratings_csv_file)
ratings_df.head()

   userId  movieId  rating   timestamp
0       1      307     3.5  1256677221
1       1      481     3.5  1256677456
2       1     1091     1.5  1256677471
3       1     1257     4.5  1256677460
4       1     1449     4.5  1256677264

### Create new Ratings DataFrame with select columns

In [59]:
clean_ratings_df = ratings_df[['movieId', 'rating']].copy()

In [61]:
clean_ratings_df = clean_ratings_df.rename(columns = {'movieId': 'movie_id'})
clean_ratings_df.head()

   movie_id  rating
0       307     3.5
1       481     3.5
2      1091     1.5
3      1257     4.5
4      1449     4.5